import "./index.scss"
import banner from "/src/assets/AboutBanner.png"
import image1 from "/src/assets/AboutFirst.png"
import {Link, useNavigate} from "react-router-dom";
import {t} from "i18next";
import {FaArrowRightLong} from "react-icons/fa6";
import Title from "../../../components/UserComponents/Title/index.jsx";
import {IoCallOutline} from "react-icons/io5";
import {LiaHandshakeSolid} from "react-icons/lia";
import {AiOutlineSafety} from "react-icons/ai";
import {LuNotebookPen} from "react-icons/lu";
function AboutUs() {
    const navigate = useNavigate();
    return (
        <div id={"aboutUs"}>
            <div className={"container"}>
                <div className={"aboutUs"}>
                    <div className={"head"}>
                            <h1>Haqqımızda</h1>
                        <p data-aos="fade-up" data-aos-delay="100">
                            <Link to={"/"}>Ana səhifə</Link>
                            <div className={"dot"}></div>
                            <Link to={"/about"}>Haqqımızda</Link>
                        </p>
                    </div>
                    <div className={"row firstRow"}>
                        <div className={"col-7 col-md-12 col-sm-12 col-xs-12"}>
                            <div className={"content"}>
                                <h2>Hər Addımda Sizinlə: Yüksək Keyfiyyətli Tibbi Xidmətlər</h2>
                                <p>Aviasiya biletlərindən viza dəstəyinə qədər hər detala diqqət yetirərək, sağlamlıq yolculuğunuzu asan və təhlükəsiz bir şəkildə reallaşdırırıq. Bizimlə olan hər addımınızda sizi etibarlı və peşəkar bir xidmət gözləyir.</p>
                                <div className={"more"} onClick={()=>navigate("/contact")}>Bizimlə əlaqəyə keç <button><FaArrowRightLong /></button></div>
                            </div>
                        </div>
                        <div className={"col-5 col-md-12 col-sm-12 col-xs-12"}>
                            <div className={"image"}>
                                <img src={image1} alt=""/>
                            </div>
                        </div>
                    </div>
                    <div className={"main"}>
                        <Title title={"Niyə Kliniken Allianz?"} desc={"Kliniken Allianz olaraq, sağlamlıq turizmi sahəsində fərqli ölkələrdəki ən yaxşı tibbi müəssisələrlə əməkdaşlıq edirik."}/>
                        <div className={"row"}>
                            <div className={"col-3 col-md-6 col-sm-12 col-xs-12"}>
                                <div className={"aboutCard"}>
                                    <div className={"icon"}>
                                        <IoCallOutline />
                                    </div>
                                    <h4>Peşəkar Tibbi Konsultasiya</h4>
                                    <p>Müxtəlif ölkələrdə tanınmış klinikalar və yüksək ixtisaslı həkimlərlə birbaşa əlaqə imkanı.</p>
                                </div>
                            </div>
                            <div className={"col-3 col-md-6 col-sm-12 col-xs-12"}>
                                <div className={"aboutCard"}>
                                    <div className={"icon"}>
                                        <LiaHandshakeSolid />
                                    </div>
                                    <h4>Beynəlxalq Klinikalarla Əməkdaşlıq</h4>
                                    <p> Ölkələrin aparıcı tibb mərkəzləri ilə rəsmi tərəfdaşlıq.</p>
                                </div>
                            </div>
                            <div className={"col-3 col-md-6 col-sm-12 col-xs-12"}>
                                <div className={"aboutCard"}>
                                    <div className={"icon"}>
                                        <AiOutlineSafety />
                                    </div>
                                    <h4>Rahat və Təhlükəsiz Səyahət</h4>
                                    <p>Aviabilet, transfer, otel, tərcüməçi və digər bütün ehtiyacların tam təşkili.</p>
                                </div>
                            </div>
                            <div className={"col-3 col-md-6 col-sm-12 col-xs-12"}>
                                <div className={"aboutCard"}>
                                    <div className={"icon"}>
                                        <LuNotebookPen />
                                    </div>
                                    <h4>Şəffaf Qiymət və Rəsmi Sənədləşmə</h4>
                                    <p>Bütün xidmətlər rəsmi şəkildə, gizli xərclər olmadan təklif olunur.</p>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
            <div className={"bannerAbout"} >
                <img src={banner} alt="banner logo" />
            </div>
            <div className={"icons"}>
                <div className={"icon1"}>
                    <svg xmlns="http://www.w3.org/2000/svg" width="47" height="47" viewBox="0 0 47 47" fill="none">
                        <path d="M21.5415 42.1042V9.79167C21.5415 8.48611 21.7374 5.875 18.604 5.875C15.5151 5.875 14.8623 9.5293 16.6457 11.0738M21.5415 42.1042C18.0461 42.1042 16.8903 38.9847 18.0741 36.9217M15.4002 8.64283C14.5123 8.48077 13.5944 8.57449 12.7277 8.91569C11.8611 9.25689 11.0724 9.83504 10.4316 10.5989C9.79078 11.3628 9.31762 12.2889 9.05403 13.295C8.79043 14.3012 8.74452 15.3564 8.92038 16.3673C9.09624 17.3781 9.48843 18.3134 10.0622 19.0902C10.636 19.867 11.3737 20.4613 12.2099 20.8206M12.171 33.3591C11.8802 33.9222 11.7356 34.5717 11.7499 35.25C11.7642 35.9282 11.937 36.6144 12.253 37.2477C12.569 37.8809 13.0184 38.4417 13.5615 38.8804C14.1046 39.3191 14.7245 39.6221 15.3664 39.7627C16.0083 39.9032 16.6524 39.8769 17.2415 39.686M10.0871 19.5388C9.52655 19.6021 8.99348 19.8203 8.53514 20.174C8.0768 20.5277 7.70734 21.006 7.45949 21.5665C7.21164 22.127 7.09305 22.7524 7.11423 23.3873C7.1354 24.0223 7.29569 24.6471 7.58088 25.2065C7.86608 25.7659 8.26739 26.2426 8.74926 26.5944C9.23113 26.9462 9.77869 27.1622 10.3434 27.2233M9.2672 27.1073C8.71451 27.486 8.26385 27.9952 7.95514 28.59C7.64643 29.1848 7.48921 29.8467 7.49739 30.5171C7.50557 31.1876 7.6789 31.8458 8.00204 32.4335C8.32518 33.0213 8.78814 33.5204 9.34993 33.8867C9.91171 34.2529 10.555 34.4751 11.2227 34.5334" stroke="#37DEA1" stroke-opacity="0.51" stroke-linecap="round"/>
                        <path d="M14.9529 24.1066C15.5389 24.1285 16.1205 23.9848 16.6463 23.6881C17.1721 23.3915 17.6258 22.951 17.9673 22.4058C18.3088 21.8606 18.5275 21.2275 18.604 20.5625C18.6805 19.8975 18.6125 19.2212 18.406 18.5934C18.1995 17.9657 17.8609 17.4059 17.4201 16.9637" stroke="#37DEA1" stroke-opacity="0.51" stroke-linecap="round" stroke-linejoin="round"/>
                        <path d="M21.4556 29.2651C20.8454 29.2657 20.2583 29.4054 19.7464 29.6716C19.2345 29.9379 18.8136 30.3226 18.5209 30.7915C18.2282 31.2605 18.0728 31.7994 18.0685 32.3603" stroke="#37DEA1" stroke-opacity="0.51" stroke-linecap="round" stroke-linejoin="round"/>
                        <path d="M12.8398 28.1423C13.1736 28.1386 13.4933 28.22 13.7706 28.3795C14.0478 28.539 14.2741 28.7715 14.4293 29.0566C14.5845 29.3416 14.6639 29.6704 14.6604 30.0137" stroke="#37DEA1" stroke-opacity="0.51" stroke-linecap="round" stroke-linejoin="round"/>
                        <path d="M14.6874 13.7083C14.4468 13.6341 14.1895 13.6291 13.9384 13.6937C13.6873 13.7583 13.4502 13.8906 13.2479 14.0788C13.0456 14.267 12.8845 14.5053 12.7789 14.7727C12.6732 15.0401 12.6262 15.3282 12.6421 15.6116C12.658 15.8949 12.7363 16.1648 12.87 16.3972" stroke="#37DEA1" stroke-opacity="0.51" stroke-linecap="round" stroke-linejoin="round"/>
                        <path opacity="0.5" d="M25.4607 42.1042V9.79167C25.4607 8.48611 25.2648 5.875 28.3982 5.875C31.4529 5.875 32.1251 9.44863 30.415 11.0216M25.4607 42.1042C28.9561 42.1042 30.1119 38.9847 28.9281 36.9217M31.602 8.64283C32.4899 8.48077 33.4078 8.57449 34.2745 8.91569C35.1411 9.25689 35.9298 9.83504 36.5706 10.5989C37.2114 11.3628 37.6846 12.2889 37.9482 13.295C38.2118 14.3012 38.2577 15.3564 38.0818 16.3673C37.906 17.3781 37.5138 18.3134 36.94 19.0902C36.3662 19.867 35.6285 20.4613 34.7923 20.8206M34.8312 33.3591C35.122 33.9222 35.2667 34.5717 35.2524 35.25C35.2381 35.9282 35.0653 36.6144 34.7493 37.2477C34.4333 37.8809 33.9838 38.4417 33.4408 38.8804C32.8977 39.3191 32.2777 39.6221 31.6358 39.7627C30.9939 39.9032 30.3499 39.8769 29.7608 39.686M36.9151 19.5388C37.4756 19.6021 38.0087 19.8203 38.4671 20.174C38.9254 20.5277 39.2949 21.006 39.5427 21.5665C39.7906 22.127 39.9091 22.7524 39.888 23.3873C39.8668 24.0223 39.7065 24.6471 39.4213 25.2065C39.1361 25.7659 38.7348 26.2426 38.2529 26.5944C37.7711 26.9462 37.2235 27.1622 36.6588 27.2233M37.735 27.1073C38.2877 27.486 38.7383 27.9952 39.0471 28.59C39.3558 29.1848 39.513 29.8467 39.5048 30.5171C39.4966 31.1876 39.3233 31.8458 39.0002 32.4335C38.677 33.0213 38.2141 33.5204 37.6523 33.8867C37.0905 34.2529 36.4472 34.4751 35.7795 34.5334" stroke="#47D1D6" stroke-opacity="0.78" stroke-linecap="round"/>
                        <path opacity="0.5" d="M33.0729 23.629C32.4989 23.7487 31.9014 23.7044 31.3333 23.5C30.7653 23.2956 30.2442 22.9373 29.8162 22.457C29.3883 21.9767 29.0667 21.3891 28.8799 20.7463C28.6931 20.1035 28.6469 19.4253 28.7454 18.7719" stroke="#47D1D6" stroke-opacity="0.78" stroke-linecap="round" stroke-linejoin="round"/>
                        <path opacity="0.5" d="M30.1482 32.7039C30.7579 32.678 31.3387 32.5143 31.8392 32.2271C32.3396 31.94 32.7443 31.5383 33.0174 31.0576C33.2905 30.5769 33.4235 30.0321 33.4046 29.4715" stroke="#47D1D6" stroke-opacity="0.78" stroke-linecap="round" stroke-linejoin="round"/>
                        <path opacity="0.5" d="M29.0508 26.5812C28.9279 26.8917 28.8897 27.2194 28.9395 27.5353C28.9893 27.8513 29.1256 28.1457 29.3363 28.3926C29.547 28.6395 29.8256 28.8311 30.1475 28.9506" stroke="#47D1D6" stroke-opacity="0.78" stroke-linecap="round" stroke-linejoin="round"/>
                        <path opacity="0.5" d="M32.6938 14.402C32.9245 14.5031 33.1225 14.6674 33.2703 14.8804C33.4182 15.0934 33.5113 15.3485 33.5414 15.6231C33.5715 15.8978 33.5377 16.1834 33.4429 16.4549C33.3482 16.7263 33.1955 16.9751 32.9983 17.1792C32.8011 17.3833 32.5655 17.5364 32.3124 17.625" stroke="#47D1D6" stroke-opacity="0.78" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>
                </div>
                <div className={"icon2"}>
                    <svg xmlns="http://www.w3.org/2000/svg" width="57" height="57" viewBox="0 0 57 57" fill="none">
                        <path d="M51.0625 28.5C51.0625 41.6168 41.6168 51.0625 28.5 51.0625C15.3832 51.0625 5.9375 41.6168 5.9375 28.5C5.9375 15.3832 15.3832 5.9375 28.5 5.9375C41.6168 5.9375 51.0625 15.3832 51.0625 28.5Z" stroke="#83EFC8" stroke-opacity="0.51" stroke-width="1.95833"/>
                        <path opacity="0.5" d="M24.6479 18.8327C24.4219 19.3782 24.4219 20.0699 24.4219 21.4531V24.3044C24.4219 24.3598 24.4219 24.3875 24.4047 24.4047C24.3875 24.4219 24.3598 24.4219 24.3044 24.4219H21.4531C20.0699 24.4219 19.3782 24.4219 18.8327 24.6479C18.1052 24.9492 17.5273 25.5271 17.226 26.2545C17 26.8001 17 27.4917 17 28.875C17 30.2583 17 30.9499 17.226 31.4955C17.5273 32.2229 18.1052 32.8008 18.8327 33.1021C19.3782 33.3281 20.0699 33.3281 21.4531 33.3281H24.3044C24.3598 33.3281 24.3875 33.3281 24.4047 33.3453C24.4219 33.3625 24.4219 33.3902 24.4219 33.4456V36.2969C24.4219 37.6801 24.4219 38.3718 24.6479 38.9173C24.9492 39.6448 25.5271 40.2227 26.2545 40.524C26.8001 40.75 27.4917 40.75 28.875 40.75C30.2583 40.75 30.9499 40.75 31.4955 40.524C32.2229 40.2227 32.8008 39.6448 33.1021 38.9173C33.3281 38.3718 33.3281 37.6801 33.3281 36.2969V33.4456C33.3281 33.3902 33.3281 33.3625 33.3453 33.3453C33.3625 33.3281 33.3902 33.3281 33.4456 33.3281H36.2969C37.6801 33.3281 38.3718 33.3281 38.9173 33.1021C39.6448 32.8008 40.2227 32.2229 40.524 31.4955C40.75 30.9499 40.75 30.2583 40.75 28.875C40.75 27.4917 40.75 26.8001 40.524 26.2545C40.2227 25.5271 39.6448 24.9492 38.9173 24.6479C38.3718 24.4219 37.6801 24.4219 36.2969 24.4219H33.4456C33.3902 24.4219 33.3625 24.4219 33.3453 24.4047C33.3281 24.3875 33.3281 24.3598 33.3281 24.3044V21.4531C33.3281 20.0699 33.3281 19.3782 33.1021 18.8327C32.8008 18.1052 32.2229 17.5273 31.4955 17.226C30.9499 17 30.2583 17 28.875 17C27.4917 17 26.8001 17 26.2545 17.226C25.5271 17.5273 24.9492 18.1052 24.6479 18.8327Z" stroke="#83EFC8" stroke-opacity="0.51" stroke-width="1.95833"/>
                    </svg>
                </div>
                <div className={'icon3'}>
                    <svg xmlns="http://www.w3.org/2000/svg" width="57" height="57" viewBox="0 0 57 57" fill="none">
                        <path opacity="0.5" d="M23.75 40.375C23.75 52.25 43.9375 53.4375 43.9375 40.375V30.875" stroke="#CACACA"/>
                        <path opacity="0.5" d="M43.9375 27.2888H43.9612V27.3125H43.9375V27.2888Z" stroke="#47D1D6" stroke-opacity="0.78" stroke-linejoin="round"/>
                        <path d="M47.5 27.3125C47.5 29.28 45.905 30.875 43.9375 30.875C41.97 30.875 40.375 29.28 40.375 27.3125C40.375 25.345 41.97 23.75 43.9375 23.75C45.905 23.75 47.5 25.345 47.5 27.3125Z" stroke="#47D1D6" stroke-opacity="0.78"/>
                        <path d="M17.8125 11.875V11.875C15.0448 11.875 13.661 11.875 12.7887 12.7193C12.7652 12.742 12.742 12.7652 12.7193 12.7887C11.875 13.661 11.875 15.0448 11.875 17.8125V28.5C11.875 34.0353 11.875 36.803 13.5635 38.5477C13.609 38.5947 13.6553 38.641 13.7023 38.6865C15.447 40.375 18.2147 40.375 23.75 40.375V40.375C29.2853 40.375 32.053 40.375 33.7977 38.6865C33.8447 38.641 33.891 38.5947 33.9365 38.5477C35.625 36.803 35.625 34.0353 35.625 28.5V16.625C35.625 14.992 35.625 14.1755 35.3156 13.5481C35.0235 12.9558 34.5442 12.4765 33.9519 12.1844C33.3245 11.875 32.508 11.875 30.875 11.875V11.875M17.8125 11.875C17.8125 13.1867 18.8758 14.25 20.1875 14.25C21.4992 14.25 22.5625 13.1867 22.5625 11.875C22.5625 10.5633 21.4992 9.5 20.1875 9.5C18.8758 9.5 17.8125 10.5633 17.8125 11.875ZM30.875 11.875C30.875 13.1867 29.8117 14.25 28.5 14.25C27.1883 14.25 26.125 13.1867 26.125 11.875C26.125 10.5633 27.1883 9.5 28.5 9.5C29.8117 9.5 30.875 10.5633 30.875 11.875Z" stroke="#37DEA1" stroke-opacity="0.51"/>
                    </svg>
                </div>
                <div className={"icon4"}>
                    <svg xmlns="http://www.w3.org/2000/svg" width="57" height="57" viewBox="0 0 57 57" fill="none">
                        <path d="M28.5 49.6268C16.625 45.125 7.125 34.7392 7.125 22.1795C7.125 15.1706 12.4474 9.49997 19.0095 9.49997C22.8997 9.49997 26.3411 11.496 28.5 14.5809C30.6589 11.496 34.1216 9.49997 37.9905 9.49997C44.5526 9.49997 49.875 15.1706 49.875 22.1795C49.875 32.8018 40.375 45.125 28.5 49.6268Z" stroke="#E9E9E9" stroke-opacity="0.78" stroke-width="2.375" stroke-linecap="round" stroke-linejoin="round"/>
                        <path opacity="0.5" d="M48.6875 28.5H42.9959C42.8385 28.5 42.6874 28.4374 42.5761 28.3261L39.77 25.52C39.4834 25.2334 39.0003 25.3118 38.8191 25.6743L35.9934 31.3257C35.8122 31.6882 35.3291 31.7666 35.0425 31.48L32.5581 28.9956C32.2987 28.7362 31.8684 28.7718 31.6551 29.0703L26.8905 35.7407C26.5932 36.157 25.9439 36.0275 25.8288 35.5291L22.9099 22.8802C22.7876 22.3503 22.0764 22.25 21.8123 22.7254L17.0697 31.2621C16.8607 31.6382 16.3337 31.6742 16.0756 31.33L13.4733 27.8602C13.2565 27.5711 12.8339 27.5411 12.5784 27.7966L10.8614 29.5136C10.7501 29.6249 10.599 29.6875 10.4416 29.6875H8.3125" stroke="#37DEA1" stroke-opacity="0.51" stroke-width="2.375" stroke-linecap="round"/>
                    </svg>
                </div>
            </div>
        </div>
    );
}

export default AboutUs;